### Feedback Note
*   처음에는 xls, csv 에서 계산, 후에 계산이 안되서 데이타 엔지니어 채용 부탁
*   Shopify (salesforce 규모) page customize, 
*   front engineering sckill 있으면 취업 유리
*   Shopify trim, 수정 등 
*   order 안에 shipping, tax, 등
*   csv 중복다운 등 계산 후 실수가 많아 매출 계산이 어려움
*   데이타일을 하게되면 주어진 데이타를 믿지 말 것. 뭐든 체크, 
*   orderid 공백 여부 알기 힘듬, 가능하면 레코드를 다 로딩하고 다보거나 id를 보고, order_id min/max 체크  
*   time stamp min/max 체크 등
*   공동으로 운영하는 스프레드 만들고 definition 정의

In [ ]:
!pip install sqlalchemy==1.3.2

Collecting sqlalchemy==1.3.2
  Downloading https://files.pythonhosted.org/packages/2a/9b/9b8aa2d5dbe2e4052cb4c84b8cf5e31686943f24b0565f436439bdc343b5/SQLAlchemy-1.3.2.tar.gz (5.9MB)
     |████████████████████████████████| 5.9MB 5.1MB/s
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.2-cp37-cp37m-linux_x86_64.whl size=1182901 sha256=402ee8a5774945f4feaf814cdfb2319ec3a0ca789b187ce98bbdfb81a108d103
  Stored in directory: /root/.cache/pip/wheels/36/2a/2e/c0c1dbccff6eb1d7f7e9fdd074839aa24f03c7dbda0dced17c
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Found existing installation: SQLAlchemy 1.4.7
    Uninstalling SQLAlchemy-1.4.7:
      Successfully uninstalled SQLAlchemy-1.4.7
Successfully installed sqlalchemy-1.3.2

In [ ]:
%load_ext sql
#엔진로딩

In [ ]:
 # ID와 PW를 자신의 환경에 맞게 수정, redshift 연결
%sql postgresql://jieunshop200:Jieunshop200!1@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: jieunshop200@dev'

In [ ]:
%%sql
SELECT * FROM  raw_data.order_item
LIMIT 10

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('2871721885809101', 'AAE', 1, 53.19),
 ('2233258901617101', 'AAA', 1, 30.98),
 ('2255039201393101', 'AAA', 1, 28.29),
 ('2301481418865101', 'AAA', 1, 28.29),
 ('2493459628145101', 'AAA', 1, 28.29),
 ('2627949854833101', 'AAA', 1, 28.29),
 ('2734789329009101', 'AAA', 1, 28.29),
 ('2873103712369101', 'AAB', 1, 70.79),
 ('2877809393777101', 'AAB', 1, 70.79),
 ('2889476702321101', 'AAB', 1, 70.79)]

In [ ]:
%%sql
SELECT * FROM raw_data.order
WHERE refunded_at is not null
LIMIT 20

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
20 rows affected.

[('2955897077873101', datetime.datetime(2020, 9, 13, 23, 8, 41), datetime.datetime(2020, 9, 13, 23, 59, 14)),
 ('2860653510769101', datetime.datetime(2020, 8, 6, 21, 14, 58), datetime.datetime(2020, 8, 6, 21, 23)),
 ('3077130551409101', datetime.datetime(2020, 11, 9, 21, 57, 15), datetime.datetime(2020, 11, 10, 11, 28, 18)),
 ('2630539214961101', datetime.datetime(2020, 5, 25, 0, 36, 8), datetime.datetime(2020, 5, 25, 0, 37, 16)),
 ('2755078291569101', datetime.datetime(2020, 7, 6, 11, 37, 30), datetime.datetime(2020, 7, 6, 12, 16, 7)),
 ('3060935262321101', datetime.datetime(2020, 11, 2, 0, 45, 19), datetime.datetime(2020, 11, 2, 9, 36, 42)),
 ('3069575430257101', datetime.datetime(2020, 11, 6, 9, 17, 16), datetime.datetime(2020, 11, 6, 18, 16, 48)),
 ('2735960653937101', datetime.datetime(2020, 6, 30, 12, 32, 18), datetime.datetime(2020, 6, 30, 13, 24, 42)),
 ('2735924936817101', datetime.datetime(2020, 6, 30, 12, 17, 15), datetime.datetime(2020, 6, 30, 13, 24, 6)),
 ('1799150895217101', datetime.datetime(2019, 7, 28, 15, 9, 55), datetime.datetime(2019, 7, 28, 15, 14, 34)),
 ('3028925710449101', datetime.datetime(2020, 10, 15, 21, 52, 25), datetime.datetime(2020, 10, 16, 11, 2, 27)),
 ('2785234321521101', datetime.datetime(2020, 7, 12, 21, 27, 9), datetime.datetime(2020, 7, 12, 23, 19, 34)),
 ('1967769256049101', datetime.datetime(2019, 9, 21, 13, 57, 53), datetime.datetime(2019, 9, 22, 9, 50, 11)),
 ('1972235305073101', datetime.datetime(2019, 9, 22, 15, 34, 1), datetime.datetime(2019, 9, 23, 14, 11, 22)),
 ('2863097315441101', datetime.datetime(2020, 8, 7, 20, 4, 55), datetime.datetime(2020, 8, 7, 20, 20, 29)),
 ('3078316654705101', datetime.datetime(2020, 11, 10, 12, 59, 45), datetime.datetime(2020, 11, 10, 13, 5, 37)),
 ('2043713028209101', datetime.datetime(2019, 10, 20, 16, 42, 13), datetime.datetime(2019, 10, 21, 10, 21, 33)),
 ('1908453572721101', datetime.datetime(2019, 9, 6, 0, 26, 50), datetime.datetime(2019, 9, 6, 0, 35, 44)),
 ('1309863673969101', datetime.datetime(2019, 4, 29, 10, 53, 28), datetime.datetime(2019, 4, 29, 10, 54, 15)),
 ('1799177666673101', datetime.datetime(2019, 7, 28, 15, 19, 13), datetime.datetime(2019, 8, 16, 16, 19, 23))]

In [ ]:
# raw_data.order_item: 비어있는 ORDER ID (SPACE) 문제 확인
%%sql
SELECT CASE WHEN order_id is null then 'XXX'
            WHEN order_id = ' ' Then 'Space'
            ELSE 'YYY' END orderid_check, count(*) cnt
FROM raw_data.order_item
WHERE orderid_check <> 'YYY'
GROUP BY orderid_check

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('Space', 8)]

In [ ]:
# raw_data.order: 비어있는 ORDER ID (SPACE) 문제 확인
%%sql
SELECT CASE WHEN order_id is null then 'XXX'
            WHEN order_id = ' ' Then 'Space'
            ELSE 'YYY' END orderid_check, count(*) cnt
FROM raw_data.order
WHERE orderid_check <> 'YYY'
GROUP BY orderid_check

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('Space', 3)]

In [ ]:
%%sql
SELECT *
FROM raw_data.order
WHERE order_id < 1;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
3 rows affected.

[('', datetime.datetime(2019, 8, 2, 14, 19, 37), None),
 ('', datetime.datetime(2019, 11, 26, 10, 26, 29), None),
 ('', datetime.datetime(2019, 12, 28, 11, 37, 14), None)]

In [ ]:
%%sql

SELECT ' ' < '1'

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(True,)]


중복(모든리코드가 동일)과 비어있는 order_id 문제를 해결하고 풀어야 합니다. 
전자는 distinct한 레코드들을 사용하면 되고 
후자는 그런 레코드들을 무시하면 됩니다.

In [ ]:
%%sql
WITH new_table AS(
SELECT o.order_id,product_name,	quantity,	amount,	ordered_at, refunded_at
FROM raw_data.order_item oi
FULL JOIN raw_data.order o
  ON oi.order_id = o.order_id
WHERE oi.order_id <> ' ' or o.order_id <> ' '
)
SELECT distinct *
FROM new_table
WHERE refunded_at is null
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('2255039201393101', 'AAA', 1, 28.29, datetime.datetime(2020, 1, 25, 21, 48, 51), None),
 ('2493459628145101', 'AAA', 1, 28.29, datetime.datetime(2020, 4, 7, 3, 15, 57), None),
 ('2627949854833101', 'AAA', 1, 28.29, datetime.datetime(2020, 5, 24, 3, 12, 29), None),
 ('2896091611249101', 'AAB', 3, 70.79, datetime.datetime(2020, 8, 23, 19, 0, 1), None),
 ('2909344661617101', 'AAB', 1, 70.79, datetime.datetime(2020, 8, 30, 3, 15, 44), None)]

1> 환불되지 않은 주문들만 봤을 때 주문수량 (quantity) 기준으로 가장 많이 주문된 Top 5 상품의 이름과 총 주문수량을 찾아보세요

####평가요소
*  질문을 하느냐
*  질문에 대한 정의를 하느냐 
*  클린업을 하느냐 (정의 세우는것 필요)

In [ ]:
%%sql -- 선생님 답안

SELECT oi.product_name, SUM(quantity)
FROM( 
    SELECT DISTINCT *
    FROM raw_data.order
)o
JOIN(SELECT DISTINCT *
     FROM raw_data.order_item
     WHERE order_id <>''
     ) oi ON o.order_id = oi.order_id
WHERE o.refunded_at IS NULL
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ABO', 4163), ('AAP', 2802), ('AAV', 1050), ('ABH', 924), ('ABA', 750)]

In [ ]:
%%sql 
WITH new_table AS(
SELECT DISTINCT *
FROM raw_data.order_item oi
FULL JOIN raw_data.order o
  ON oi.order_id = o.order_id
WHERE oi.order_id <> ' ' or o.order_id <> ' '
)
SELECT product_name, SUM(quantity)
FROM new_table
WHERE refunded_at is null  
GROUP BY product_name
ORDER BY 2 DESC
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ABO', 4163), ('AAP', 2802), ('AAV', 1050), ('ABH', 924), ('ABA', 750)]

2> 환불되지 않은 주문들만 봤을 때 주문금액 (amount*quantity) 기준으로 가장 많이 주문된 Top 5 상품의 이름과 총 주문금액을 찾아보세요

In [ ]:
%%sql# 선생님 답안

SELECT oi.product_name, SUM(quantity*amount)::decimal(7,2)
FROM( 
    SELECT *
    FROM raw_data.order
)o
JOIN(SELECT DISTINCT *
     FROM raw_data.order_item
     WHERE order_id <>''
     ) oi ON o.order_id = oi.order_id
WHERE o.refunded_at IS NULL
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ABO', Decimal('64634.71')),
 ('AAV', Decimal('54642.35')),
 ('AAP', Decimal('51599.13')),
 ('ABJ', Decimal('37002.93')),
 ('AAZ', Decimal('24124.16'))]

In [ ]:
# 인애님 답안
%%sql

Select OI.product_name as product_name, round(sum(OI.amount * OI.quantity), 2) as TotalPrice
from (
    select distinct * 
    from raw_data.order
)as O
inner join (
    select distinct *
    from raw_data.order_item
) as OI on O.order_id = OI.order_id
where O.refunded_at is null and OI.order_id is not null and OI.order_id <> ' '
group by 1
order by 2 desc
limit 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ABO', 64634.71),
 ('AAV', 54642.35),
 ('AAP', 51599.13),
 ('ABJ', 37002.93),
 ('AAZ', 24124.16)]

In [ ]:
%%sql
WITH new_table AS(
SELECT DISTINCT *
FROM raw_data.order_item oi
FULL JOIN raw_data.order o
  ON oi.order_id = o.order_id
WHERE oi.order_id <> ' ' or o.order_id <> ' '
)
SELECT product_name, sum(amount*quantity) AS total_amount
FROM new_table
WHERE refunded_at is null  
GROUP BY product_name
ORDER BY 2 DESC
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ABO', 64634.7100000001),
 ('AAV', 54642.3500000005),
 ('AAP', 51599.1300000007),
 ('ABJ', 37002.9299999999),
 ('AAZ', 24124.16)]

3> Cohort monthly table (MAU - Monthly Active User)
*   sql로 기본 데이타를 뽑고, 그 데이타로 피봇팅을 다른 테이블 (pandas - pivot table) 에서 하기
*   인터뷰시 많이 나오는 질문, 첫 rate, retention rate의 관계

In [ ]:
%%sql 
SELECT cohort_month, 
DATEDIFF(month, cohort_month, visited_month)+1 month_N, 
COUNT(DISTINCT cohort.userid) unique_users 
FROM ( 
  SELECT userid, MIN(DATE_TRUNC('month', ts)) cohort_month 
  FROM raw_data.user_session_channel usc 
  JOIN raw_data.session_timestamp t ON t.sessionid = usc.sessionid 
  GROUP BY 1 
) cohort 
JOIN ( 
  SELECT DISTINCT userid, DATE_TRUNC('month', ts) visited_month 
  FROM raw_data.user_session_channel usc 
  JOIN raw_data.session_timestamp t ON t.sessionid = usc.sessionid 
) visit ON cohort.cohort_month <= visit.visited_month and cohort.userid = visit.userid 
GROUP BY 1, 2 
ORDER BY 1, 2

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
28 rows affected.

[(datetime.datetime(2019, 5, 1, 0, 0), 1, 281),
 (datetime.datetime(2019, 5, 1, 0, 0), 2, 262),
 (datetime.datetime(2019, 5, 1, 0, 0), 3, 237),
 (datetime.datetime(2019, 5, 1, 0, 0), 4, 229),
 (datetime.datetime(2019, 5, 1, 0, 0), 5, 224),
 (datetime.datetime(2019, 5, 1, 0, 0), 6, 213),
 (datetime.datetime(2019, 5, 1, 0, 0), 7, 206),
 (datetime.datetime(2019, 6, 1, 0, 0), 1, 197),
 (datetime.datetime(2019, 6, 1, 0, 0), 2, 175),
 (datetime.datetime(2019, 6, 1, 0, 0), 3, 160),
 (datetime.datetime(2019, 6, 1, 0, 0), 4, 150),
 (datetime.datetime(2019, 6, 1, 0, 0), 5, 148),
 (datetime.datetime(2019, 6, 1, 0, 0), 6, 145),
 (datetime.datetime(2019, 7, 1, 0, 0), 1, 211),
 (datetime.datetime(2019, 7, 1, 0, 0), 2, 189),
 (datetime.datetime(2019, 7, 1, 0, 0), 3, 175),
 (datetime.datetime(2019, 7, 1, 0, 0), 4, 167),
 (datetime.datetime(2019, 7, 1, 0, 0), 5, 155),
 (datetime.datetime(2019, 8, 1, 0, 0), 1, 84),
 (datetime.datetime(2019, 8, 1, 0, 0), 2, 73),
 (datetime.datetime(2019, 8, 1, 0, 0), 3, 71),
 (datetime.datetime(2019, 8, 1, 0, 0), 4, 69),
 (datetime.datetime(2019, 9, 1, 0, 0), 1, 17),
 (datetime.datetime(2019, 9, 1, 0, 0), 2, 14),
 (datetime.datetime(2019, 9, 1, 0, 0), 3, 13),
 (datetime.datetime(2019, 10, 1, 0, 0), 1, 150),
 (datetime.datetime(2019, 10, 1, 0, 0), 2, 124),
 (datetime.datetime(2019, 11, 1, 0, 0), 1, 9)]

In [ ]:
result = %sql SELECT cohort_month, \
DATEDIFF(month, cohort_month, visited_month)+1 month_N, \
COUNT(DISTINCT cohort.userid) unique_users \
FROM ( \
  SELECT userid, MIN(DATE_TRUNC('month', ts)) cohort_month \
  FROM raw_data.user_session_channel usc \
  JOIN raw_data.session_timestamp t ON t.sessionid = usc.sessionid \
  GROUP BY 1 \
) cohort \
JOIN ( \
  SELECT DISTINCT userid, DATE_TRUNC('month', ts) visited_month \
  FROM raw_data.user_session_channel usc \
  JOIN raw_data.session_timestamp t ON t.sessionid = usc.sessionid \
) visit ON cohort.cohort_month <= visit.visited_month and cohort.userid = visit.userid \
GROUP BY 1, 2 \
ORDER BY 1, 2
df = result.DataFrame()

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
28 rows affected.

In [ ]:
df.head()

  cohort_month  month_n  unique_users
0   2019-05-01        1           281
1   2019-05-01        2           262
2   2019-05-01        3           237
3   2019-05-01        4           229
4   2019-05-01        5           224

In [ ]:
df.pivot_table(index='cohort_month', values="unique_users", columns="month_n")

month_n           1      2      3      4      5      6      7
cohort_month
2019-05-01    281.0  262.0  237.0  229.0  224.0  213.0  206.0
2019-06-01    197.0  175.0  160.0  150.0  148.0  145.0    NaN
2019-07-01    211.0  189.0  175.0  167.0  155.0    NaN    NaN
2019-08-01     84.0   73.0   71.0   69.0    NaN    NaN    NaN
2019-09-01     17.0   14.0   13.0    NaN    NaN    NaN    NaN
2019-10-01    150.0  124.0    NaN    NaN    NaN    NaN    NaN
2019-11-01      9.0    NaN    NaN    NaN    NaN    NaN    NaN